Revit 2027 API
AlignedDistributionRebarHandles Enumeration
 This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Aligned Distribution have. The tag of a [!:Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle] RebarConstrainedHandle can be obtained by calling the [!:Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()]
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AlignedDistributionRebarHandles
Public Enumeration AlignedDistributionRebarHandles
public enum class AlignedDistributionRebarHandles
type AlignedDistributionRebarHandles
Members
Member name | Value | Description
DistributionPath1 | 1 |  Tag for handle representing the Distribution Path 1. This handle accepts constraints only to host faces or to covers.
DistributionPath2 | 2 |  Tag for handle representing the Distribution Path 2. This handle accepts constraints only to host faces or to covers.
EndOfDistributionPath | 4 |  Tag for handle representing the End Distribution Path. This handle accepts constraints only to host faces or to covers.
HostSurface | 0 |  Tag for handle representing the Host Surface. This handle accepts constraints only to host faces or to covers.
SetOrientation | 5 |  Tag for handle representing the Set Orientation. This handle accepts constraints only to host faces or to covers.
StartOfDistributionPath | 3 |  Tag for handle representing the Start Distribution Path. This handle accepts constraints only to host faces or to covers.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace